# -*- coding: utf-8 -*-

# Вывести на консоль жителей комнат (модули room_1 и room_2)
# Формат: В комнате room_1 живут: ...
import room_1, room_2
# TODO здесь ваш код
# TODO Тудушки надо бы удалять) иначе путаница возникнет
# TODO Тут ещё бы надо внести пару стилистических правок
# TODO Во-первых про импорты - стоит использовать конструкцию from ... import список as имя
# TODO Она позволяет нам избавиться от лишнего кода (не писать приставку room_1/2)
# TODO Во-вторых просто списки выводить не красиво, стоит использовать метод .join()
print ('В комнате room_1 живут:', room_1.folks)
print ('В комнате room_2 живут:', room_2.folks)
# TODO И ещё не забывайте про Code/Reformat Code)


