def buns():
    print('Возьмем булочку для гамбургеров, поджаренную в тостере')
def cutlets():
    print('Положим бифштексы из говядины рубленые, приготовленные на гриле')
def onion():
    print('Добавим лук репчатый свежий резаный')
def cucumber():
    print('Добавим огурцы маринованные резанные')
def tomato():
    print('А теперь добавим 3 дольки спелого помидора')
def cheese():
    print('А теперь добавим ломтик сыра чеддер')
def mayo():
    print('Смажем маойнезным соусом')
# Создать модуль my_burger. В нем определить функции добавления инградиентов:
#  - булочки
#  - котлеты
#  - огурчика
#  - помидорчика
#  - майонеза
#  - сыра