#!/usr/bin/env python3
# -*- coding: utf-8 -*-

# Создайте списки:

# моя семья (минимум 3 элемента, есть еще дедушки и бабушки, если что)
my_family = ['Отец', 'Брат', 'Мать']

# список списков приблизителного роста членов вашей семьи
my_family_height = [
    ['Отец', 178],
    ['Брат', 185],
    ['Мать', 164]

]
print('Рост отца -', my_family_height[0][1], 'см')
summary_height = my_family_height[0][1] + my_family_height[1][1] + my_family_height[2][1]
print('Общий рост моей семьи -', summary_height, 'см')

# Выведите на консоль рост отца в формате
#   Рост отца - ХХ см

# Выведите на консоль общий рост вашей семьи как сумму ростов всех членов
#   Общий рост моей семьи - ХХ см
